tap "akeylesslabs/tap", trusted: true
tap "borgbackup/tap", trusted: true
tap "carlocab/personal", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew-ffmpeg/ffmpeg", trusted: true
tap "jstkdng/programs", trusted: true
tap "krishkrosh/apps", trusted: true
tap "mongodb/brew", trusted: true
tap "osx-cross/avr", trusted: true
tap "supersonic-app/supersonic", trusted: true
tap "teamookla/speedtest", trusted: true
tap "wswenyue/apkparser", trusted: true
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Download with resuming and segmented downloading
brew "aria2"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Record and share terminal sessions
brew "asciinema"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Light UNIX download accelerator
brew "axel"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Debian package management system
brew "dpkg"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Development framework for multimedia applications
brew "gstreamer"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Tool to unpack installers created by Inno Setup
brew "innoextract"
# Offline radio signal analyser
brew "inspectrum"
# Dex to Java decompiler
brew "jadx"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Sophisticated file transfer program
brew "lftp"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# CLI for interacting with MCP servers using both stdio and HTTP transport
brew "mcptools"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Dynamic modification of a user's environment via modulefiles
brew "modules"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cross-platform library for audio I/O
brew "portaudio"
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Sound system for POSIX OSes
brew "pulseaudio"
# Command-line interface for qBittorrent written in Go
brew "qbittorrent-cli"
# Generic machine emulator and virtualizer
brew "qemu"
# Reverse engineering framework
brew "radare2"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio"
# Utility that provides fast incremental file transfer
brew "rsync"
# Program to decode radio transmissions from devices
brew "rtl_433", args: ["HEAD"]
# Execute commands inside your runbooks, docs, and READMEs
brew "runme"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Tool to convert Android sparse images to raw images and back
brew "simg2img"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Compressed read-only file system for Linux
brew "squashfs"
# Non-interactive SSH password auth
brew "sshpass"
# Statistics from the command-line
brew "st"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Version control system designed to be a better CVS
brew "subversion"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Web Assembly Binary Toolkit
brew "wabt"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Akeyless CLI
brew "akeylesslabs/tap/akeyless"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup/tap/borgbackup-fuse"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@14", link: true
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9", link: false
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Android apk file parsing tool
brew "wswenyue/apkparser/apkparser"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Two and three-way file comparison, merging and folder synchronisation
cask "araxis-merge"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# E-books management software
cask "calibre"
# Web debugging Proxy application
cask "charles"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Tool to run Windows software
cask "crossover"
# Reverse engineering platform powered by Rizin
cask "cutter"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# Developer platform
cask "dotnet-sdk"
# Matrix collaboration client
cask "element"
# Web browser
cask "firefox"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@beta"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Menu bar manager
cask "jordanbaird-ice"
# Subtitle editor
cask "jubler"
# Keyboard customiser
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Power management and monitoring for Apple Mx processors
cask "mx-power-gadget"
# Document scanning application
cask "naps2"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# G-code generator for 3D printers
cask "orcaslicer"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open source virtual/remote desktop application
cask "rustdesk"
# Video game digital distribution service
cask "steam"
# Command-line client for Steam
cask "steamcmd"
# A lightweight and full-featured cross-platform desktop client for self-hosted music servers
cask "supersonic-app/supersonic/supersonic"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Finder thumbnail provider for some .gcode, .bgcode and .3mf files
cask "thumbhost3mf"
# Customizable email client
cask "thunderbird"
# Turn your MacBook's trackpad into a precise digital weighing scale
cask "krishkrosh/apps/trackweight"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "karakeeper Bookmarker", id: 6746722790
mas "Speedtest", id: 1153157709
mas "udm14 for Safari", id: 6520379591
mas "Universal Print", id: 6450432292
mas "Userscripts", id: 1463298887
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
uv "abxrcli"
uv "aws-sso"
uv "black"
uv "data-hacks3"
uv "esphome"
uv "flake8"
uv "isort"
uv "jinjanator"
uv "llm", with: ["llm-gemini", "llm-ollama"]
uv "llm-benchmark"
uv "mcp-proxy"
uv "nb-clean"
uv "platformio"
uv "pylint"
uv "qbit-manage"
uv "reclaim", source: "git+https://github.com/CorrosiveTruths/t_balance.git"
uv "sebastientromp-chat-downloader"
uv "static-ffmpeg"
uv "transcribe-anything"
uv "whisperx"
uv "yamlfix"
