tap "adoptopenjdk/openjdk"
tap "akeylesslabs/tap"
tap "borgbackup/tap"
tap "carlocab/personal"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "mongodb/brew"
tap "stateful/tap"
tap "weaveworks/tap"
tap "wswenyue/apkparser"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Light UNIX download accelerator
brew "axel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Library for USB device access
brew "libusb"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: true
# Diff your Docker containers
brew "container-diff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS client
brew "dog"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Debian package management system
brew "dpkg"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Pseudorandom number sequence test program
brew "ent"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# ISO AAC audio encoder
brew "faac"
# ISO AAC audio decoder
brew "faad2"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Data and connectivity library for the icecast server
brew "libshout"
# HTTP client/server library for GNOME
brew "libsoup"
# Portable SCTP userland stack
brew "libusrsctp"
# Audio compression format and tools
brew "musepack"
# Implementation of the Secure Real-time Transport Protocol
brew "srtp"
# Audio metadata library
brew "taglib"
# Development framework for multimedia applications
brew "gstreamer"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Cross-platform application and UI framework
brew "qt@5"
# Offline radio signal analyser
brew "inspectrum"
# Modular IRC client
brew "irssi"
# Dex to Java decompiler
brew "jadx"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Sophisticated file transfer program
brew "lftp"
# Configuration file processing library
brew "libconfig"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Implementation of the file(1) command
brew "libmagic"
# GLib ICE implementation
brew "libnice"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Dynamic modification of a user's environment via modulefiles
brew "modules"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Multiple Repository management tool
brew "mr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Check coding standards in PHP, JavaScript and CSS
brew "php-code-sniffer"
# Minimal dumb-terminal emulation program
brew "picocom"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Show ps output as a tree
brew "pstree"
# Sound system for POSIX OSes
brew "pulseaudio"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Reverse engineering framework
brew "radare2"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio"
# Utility that provides fast incremental file transfer
brew "rsync"
# Program to decode radio transmissions from devices
brew "rtl_433", args: ["HEAD"]
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Compressed read-only file system for Linux
brew "squashfs"
# Statistics from the command-line
brew "st"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Implementation of the STUN protocol
brew "stuntman"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli"
# URL extractor/launcher
brew "urlview"
# Vi 'workalike' with many additional features
brew "vim"
# Web Assembly Binary Toolkit
brew "wabt"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Akeyless CLI
brew "akeylesslabs/tap/akeyless"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup/tap/borgbackup-fuse"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
brew "hudochenkov/sshpass/sshpass"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Execute your runbooks, docs, and READMEs.
brew "stateful/tap/runme"
# Android apk file parsing tool
brew "wswenyue/apkparser/apkparser"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# GPU-accelerated terminal emulator
cask "alacritty"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Communications service
cask "amazon-chime"
# Desktop client for Android Messages
cask "android-messages"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Two and three-way file comparison, merging and folder synchronisation
cask "araxis-merge"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Web security testing toolkit
cask "burp-suite"
# E-books management software
cask "calibre"
# Web debugging Proxy application
cask "charles"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Metadata editor for digital comics
cask "comictagger"
# Tool to run Windows software
cask "crossover"
# Reverse engineering platform powered by Rizin
cask "cutter"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Utility to hide menu bar items
cask "hiddenbar"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Remote desktop client
cask "microsoft-remote-desktop"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Neovim Client
cask "neovide"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Programmable solid 3D CAD modeller
cask "openscad"
# File system integration
cask "osxfuse"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MongoDB management tool
cask "robo-3t"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Command-line client for Steam
cask "steamcmd"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
cask "transmission-remote-gui"
# Free and open-source OpenVPN client
cask "tunnelblick"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Management tool for Unity
cask "unity-hub"
# Apple II Emulator
cask "virtual-ii"
# Virtualiser for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Desktop Backup Client for Borg
cask "vorta"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "Disk Speed Test", id: 425264550
mas "Flowchart Designer 3", id: 1512570906
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "MQTT Explorer", id: 1455214828
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
